#შემოვიტანეთ ცვლადი
longestword = 0 
#ვქმნით ციკლს 5 ჯერ იმისთვის რომ შემოვიტანოთ სიტყვები და გავუტოლოთ წინა სიტყვის ასოების რაოდენობას longestword ის საშუალებით
for i in range (5):
    #stringlenს ენიჭება შემოსული სიტყვის ასოების რაოდენობა
    stringlen = len(input("Word: "))
    #if ოპერატორის საშუალებით ვამოწმებთ შემოსული სიტყვის ასოების რაოდენობა არის თუ არა ჯერ 0 ზე მეტი და შემდეგში წინა სიტყვების რაოდენობაზე მეტი
    if longestword < stringlen:
        #longestwordს ანიჭებს ახალ მნიშვნელობას
        longestword = stringlen
#ვბეჭდავთ პასუხს
print(longestword)